InformationRegisters/УровниЗнанийОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>УровниЗнанийОбучающихся</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УровеньЗнаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниЗнаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УровниЗнанийОбучающихся/Ext/ManagerModule.bsl
Процедура ЗаписатьУровеньЗнаний(Обучающийся, УровеньЗнаний) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Период 			= ТекущаяДата();
	Запись.Обучающийся 		= Обучающийся;
	Запись.УровеньЗнаний	= УровеньЗнаний;
	Запись.Записать();
	
КонецПроцедуры

Функция ПолучитьУровеньЗнаний(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	УровниЗнанийОбучающихсяСрезПоследних.УровеньЗнаний
	                      |ИЗ
	                      |	РегистрСведений.УровниЗнанийОбучающихся.СрезПоследних(, ) КАК УровниЗнанийОбучающихсяСрезПоследних
	                      |ГДЕ
	                      |	УровниЗнанийОбучающихсяСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.УровеньЗнаний;
	Иначе
		Возврат Перечисления.УровниЗнаний.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
